:: MKLINK [[/D] | [/H] | [/J]] ссылка назначение
::        /D          Создание символической ссылки на каталог.
::                    По умолчанию создаётся символическая ссылка на файл.
::        /H          Создание жёсткой связи вместо символической ссылки.
::        /J          Создание соединения для каталога.
::        ссылка      Имя новой символической ссылки.
::        назначение  Путь (относительный или абсолютный), на который ссылается новая ссылка.

set SRC=SOURCE_DIR
set DST=DESTINATION_DIR

mklink /D %DST% %SRC%
pause